Autodesk.Revit.DB.Line.Unbound(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Returns the unbounded line that passes through the specified point in the direction of the specified vector.
origin: The start point of the line.
vector: The direction vector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified vector is almost zero and cannot be normalized.

Autodesk.Revit.DB.Line.Bound(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Returns the bounded line between the specified points.
startPoint: The start point of the line.
endPoint: The end point of the line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified points are almost equal.